x893/STM32H747XIH6-CD/Code_Disco/Demonstrations/STemWin_RB/Gui/Target/LCDConf.c
U32 *LCD_Addr[] = {
  LCD_LAYER0_FRAME_BUFFER
#if GUI_NUM_LAYERS > 1
  , LCD_LAYER1_FRAME_BUFFER
#endif
};

static int _aPendingBuffer[2] = { -1, -1 };
static int _aBufferIndex[GUI_NUM_LAYERS];
static int _axSize[GUI_NUM_LAYERS];
static int _aySize[GUI_NUM_LAYERS];
static int _aBytesPerPixels[GUI_NUM_LAYERS];
#if defined ( __ICCARM__ )
#pragma location="dma2d_palette"
#elif defined(__CC_ARM)
__attribute__((section(".dma2d_palette"), zero_init))
#elif defined(__GNUC__)
__attribute__((section(".dma2d_palette")))
#endif
static U32 DMA2D_palette[XSIZE_PHYS * sizeof(U32) * 3];
static U32 *_pDMA2D_palette = &DMA2D_palette[XSIZE_PHYS * sizeof(U32) * 0];

void LCD_LL_DrawBitmap32bpp_filter(U8 const * p);

osSemaphoreId              LcdUpdateSemaphoreId = 0;
osSemaphoreId              osDma2dSemph = 0;
osMutexId                  osDeviceMutex = 0;

void DMA2D_IRQHandler(void);

/**
  * @}
  */

/** @defgroup LCD CONFIGURATION_Private_FunctionPrototypes
  * @{
  */
void _LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine);
static void _DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat);
static void _DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat);

static void _DMA_Fill(int LayerIndex, void * pDst, int xSize, int ySize, int OffLine, U32 ColorIndex);

/* Color conversion routines using DMA2D */
DEFINE_DMA2D_COLORCONVERSION(M8888I, LTDC_PIXEL_FORMAT_ARGB8888)
/* Internal pixel format of emWin is 32 bit, because of that ARGB8888 */
DEFINE_DMA2D_COLORCONVERSION(M888,   LTDC_PIXEL_FORMAT_ARGB8888)
DEFINE_DMA2D_COLORCONVERSION(M565,   LTDC_PIXEL_FORMAT_RGB565)
DEFINE_DMA2D_COLORCONVERSION(M1555I, LTDC_PIXEL_FORMAT_ARGB1555)
DEFINE_DMA2D_COLORCONVERSION(M4444I, LTDC_PIXEL_FORMAT_ARGB4444)

/* Array of color conversions for each layer */
static const LCD_API_COLOR_CONV * _apColorConvAPI[] =
{
  COLOR_CONVERSION_0,
#if (GUI_NUM_LAYERS > 1)
  COLOR_CONVERSION_1,
#endif
};

static U32 LCD_GetBufferAddress(int LayerIndex, int BufferIndex)
{
  if (LayerIndex > GUI_NUM_LAYERS)
    return 0;

  return (U32 )Framebuffers[LayerIndex][BufferIndex];
}

/**
* @brief  Return Pixel format for a given layer
* @param  LayerIndex : Layer Index
* @retval Status ( 0 : 0k , 1: error)
*/
static U32 _GetPixelformat(int LayerIndex)
{
  const LCD_API_COLOR_CONV * pColorConvAPI;

  if (LayerIndex >= GUI_COUNTOF(_apColorConvAPI))
  {
    return 0;
  }
  pColorConvAPI = _apColorConvAPI[LayerIndex];
  if(pColorConvAPI == GUICC_M8888I)
  {
    return LTDC_PIXEL_FORMAT_ARGB8888;
  }
  else if (pColorConvAPI == GUICC_M888)
  {
    return LTDC_PIXEL_FORMAT_RGB888;
  }
  else if (pColorConvAPI == GUICC_M565)
  {
    return LTDC_PIXEL_FORMAT_RGB565;
  }
  else if (pColorConvAPI == GUICC_M1555I)
  {
    return LTDC_PIXEL_FORMAT_ARGB1555;
  }
  else if (pColorConvAPI == GUICC_M4444I)
  {
    return LTDC_PIXEL_FORMAT_ARGB4444;
  }
  else if (pColorConvAPI == GUICC_8666)
  {
    return LTDC_PIXEL_FORMAT_L8;
  }
  else if (pColorConvAPI == GUICC_1616I)
  {
    return LTDC_PIXEL_FORMAT_AL44;
  }
  else if (pColorConvAPI == GUICC_88666I)
  {
    return LTDC_PIXEL_FORMAT_AL88;
  }

  /* We'll hang in case of bad configuration */
  Error_Handler();

  return 0;
}
/**
  * @brief  LCD backligh 
  * @retval None
  */
void HAL_LCD_BackLighInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOF_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : PtPin */
  GPIO_InitStruct.Pin = LCD_BL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(LCD_BL_GPIO_Port, &GPIO_InitStruct);
}

static void BSP_LCD_Enable(void)
{
  static uint8_t LCD_Enabled = 0;

  if(!LCD_Enabled)
  {
    HAL_LCD_BackLighInit();
		
		HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_SET);//turn on backlight

    LCD_Enabled = 1;
  }
}

/**
  * @brief  Initialize the LCD Controller.
  * @param  None
  * @retval None
  */
static void LCD_LL_Init(void)
{
	static RCC_PeriphCLKInitTypeDef  periph_clk_init_struct;
	/* DMA2D Init needed for DeInit later */
  hdma2d.Instance = DMA2D;
  HAL_DMA2D_Init(&hdma2d);

  /* DeInit */
  hltdc.Instance = LTDC;
  HAL_LTDC_DeInit(&hltdc);

  /* Set LCD Timings */
	/* Timing Configuration */    
	hltdc.Init.HorizontalSync = (AT800480_HSYNC - 1);
	hltdc.Init.VerticalSync = (AT800480_VSYNC - 1);
	hltdc.Init.AccumulatedHBP = (AT800480_HSYNC + AT800480_HBP - 1);
	hltdc.Init.AccumulatedVBP = (AT800480_VSYNC + AT800480_VBP - 1);  
	hltdc.Init.AccumulatedActiveH = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP - 1);
	hltdc.Init.AccumulatedActiveW = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP - 1);
	hltdc.Init.TotalHeigh = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP + AT800480_VFP - 1);
	hltdc.Init.TotalWidth = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP + AT800480_HFP - 1);

	/* PLL3 Clock configuration */
  /* LTDC clock frequency = 32 Mhz */
  /* USB clock frequency = 48 Mhz */
  /* PLL3_VCO Input = HSE_VALUE/PLL3M = 1 Mhz */
  /* PLL3_VCO Output = PLL3_VCO Input * PLL3N = 384 Mhz */
  /* PLLLCDCLK = PLL3_VCO Output/PLL3R = 384/10 = 38.4 Mhz */
  /* PLLUSBCLK = PLL3_VCO Output/PLL3Q = 384/8 = 48 Mhz */
//  periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
//  periph_clk_init_struct.PLL3.PLL3M = 25;
//  periph_clk_init_struct.PLL3.PLL3N = 384;
//  periph_clk_init_struct.PLL3.PLL3P = 1;
//  periph_clk_init_struct.PLL3.PLL3Q = 8;
//  periph_clk_init_struct.PLL3.PLL3R = 10;
//  HAL_RCCEx_PeriphCLKConfig(&periph_clk_init_struct);
  
  /* background value */
  hltdc.Init.Backcolor.Blue = 0;
  hltdc.Init.Backcolor.Green = 0;
  hltdc.Init.Backcolor.Red = 0;  
  
  /* Polarity */
  hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL; 
  hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;  
  hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

  hltdc.Instance = LTDC;
  HAL_LTDC_Init(&hltdc);

